Masmiseim36/nxpSDK/boards/mimxrt685audevk/dsp_examples/xaf_playback/dsp/xaf_main_dsp.c
/*
 * Copyright 2018-2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "rpmsg_lite.h"
#include "rpmsg_queue.h"
#include "srtm_config.h"
#include "srtm_utils.h"

#include "fsl_sema42.h"
#include "fsl_common.h"
#if (defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET)
#include "fsl_memory.h"
#endif

#include <xtensa/config/core.h>
#include <xtensa/xos.h>
#include "xaf-api.h"

#include "fsl_gpio.h"

#include "board_hifi4.h"
#include "fsl_inputmux.h"
#include "fsl_dma.h"
#include "fsl_i2s.h"
#include "pin_mux.h"
#include "dsp_config.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define BOARD_XTAL_SYS_CLK_HZ 24000000U /*!< Board xtal_sys frequency in Hz */
#define BOARD_XTAL32K_CLK_HZ  32768U    /*!< Board xtal32K frequency in Hz */
#define APP_RPMSG_READY_EVENT_DATA    (1)
#define APP_RPMSG_EP_READY_EVENT_DATA (2)

#define NOTIF_EVT_RPMSG_RECEIVED_DATA (1 << 0)
#define NOTIF_EVT                     (NOTIF_EVT_RPMSG_RECEIVED_DATA)
#define DSP_THREAD_STACK_SIZE (10 * 1024)
#define DSP_THREAD_PRIORITY   (XOS_MAX_PRIORITY - 3)

#define AUDIO_BUFFER_SIZE (32 * 1024)

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
/* SRTM prototypes */
int srtm_decoder(dsp_handle_t *dsp, unsigned int *pCmdParams, unsigned int dec_name);
int srtm_encoder(dsp_handle_t *dsp, unsigned int *pCmdParams, unsigned int enc_name);
int srtm_src(dsp_handle_t *dsp, unsigned int *pCmdParams);
int srtm_pcm_gain(dsp_handle_t *dsp, unsigned int *pCmdParams);
int srtm_file_dec_create(dsp_handle_t *dsp, srtm_audio_component_t type);
#ifdef MULTICHANNEL
int srtm_file_ren_create(dsp_handle_t *dsp, uint32_t *pCmdParams);
#endif
#if XA_CLIENT_PROXY
int client_proxy_filter(dsp_handle_t *dsp, int filterOn);
#endif

/*******************************************************************************
 * Variables
 ******************************************************************************/
extern int NonCacheable_start, NonCacheable_end;
extern int NonCacheable_init_start, NonCacheable_init_end;

dsp_handle_t dsp;
static uint8_t dsp_thread_stack[DSP_THREAD_STACK_SIZE];

/*******************************************************************************
 * Code
 ******************************************************************************/
static void BOARD_InitClock(void)
{
    CLOCK_SetXtalFreq(BOARD_XTAL_SYS_CLK_HZ); /* sets external XTAL OSC freq */

    CLOCK_EnableClock(kCLOCK_InputMux);

    /* DSP_INT0_SEL18 = DMA1 */
    INPUTMUX_AttachSignal(INPUTMUX, 18U, kINPUTMUX_Dmac1ToDspInterrupt);
    /* MUB interrupt signal is selected for DSP interrupt input 1 */
    INPUTMUX_AttachSignal(INPUTMUX, 1U, kINPUTMUX_MuBToDspInterrupt);

    /* attach AUDIO PLL clock to FLEXCOMM1 (I2S1) */
    CLOCK_AttachClk(kAUDIO_PLL_to_FLEXCOMM1);
    /* attach AUDIO PLL clock to FLEXCOMM3 (I2S3) */
    CLOCK_AttachClk(kAUDIO_PLL_to_FLEXCOMM3);
}

static void XOS_Init(void)
{
    xos_set_clock_freq(XOS_CLOCK_FREQ);

    xos_start_system_timer(-1, 0);
}



static void DSP_XAF_Init(dsp_handle_t *dsp)
{
    uint8_t *version[3];

    xos_mutex_create(&dsp->audioMutex, XOS_MUTEX_WAIT_PRIORITY, 0);
    xos_mutex_create(&dsp->rpmsgMutex, XOS_MUTEX_WAIT_PRIORITY, 0);
    xos_cond_create(&dsp->ipc_waiting_cond);
    xos_cond_create(&dsp->read_waiting_cond);
    dsp->file_frame_size = 0;

    dsp->audioBuffer = ringbuf_create(AUDIO_BUFFER_SIZE);
    if (!dsp->audioBuffer)
    {
        DSP_PRINTF("[DSP_Main] ringbuffer allocation failed\r\n");
    }

    xos_event_create(&dsp->pipeline_event, 0xFF, XOS_EVENT_AUTO_CLEAR);

    xaf_get_verinfo(version);

    DSP_PRINTF("\r\n");
    DSP_PRINTF("[DSP_Main] Cadence Xtensa Audio Framework\r\n");
    DSP_PRINTF("[DSP_Main] Library Name    : %s\r\n", version[0]);
    DSP_PRINTF("[DSP_Main] Library Version : %s\r\n", version[1]);
    DSP_PRINTF("[DSP_Main] API Version     : %s\r\n", version[2]);
    DSP_PRINTF("\r\n");
}

static int handleMSG_GENERAL(dsp_handle_t *dsp, srtm_message *msg)
{
    switch (msg->head.command)
    {
        /* Return SDK key component versions to host*/
        case SRTM_Command_ECHO:
            // 0 Audio Framework version high 16 bits major, lower 16 bits minor
            msg->param[0] = ((2) << 16 | (0));
            // 1 Audio Framework API version high 16 bits major, lower 16 bits minor
            msg->param[1] = ((1) << 16 | (3));
            // 2 NatureDSP Lib version high 16 bits major, lower 16 bits minor
            msg->param[2] = ((4) << 16 | (0));
            // 3 NatureDSP Lib API version high 16 bits major, lower 16 bits minor
            msg->param[3] = ((4) << 16 | (10));
            // 4 MP3 Decoder version high 16 bits major, lower 16 bits minor
            msg->param[4] = ((3) << 16 | (18));
            // 5 AAC Decoder version high 16 bits major, lower 16 bits minor
            msg->param[5] = ((3) << 16 | (7));
#if XA_VORBIS_DECODER
            // 6 VORBIS Decoder version high 16 bits major, lower 16 bits minor
            msg->param[6] = ((1) << 16 | (12));
#endif
            // 7 OPUS Codec version high 16 bits major, lower 16 bits minor
            msg->param[7] = ((1) << 16 | (8));
            // 8 SBC Decoder version high 16 bits major, lower 16 bits minor
            msg->param[8] = ((1) << 16 | (4));
            // 9 SBC Encoder version high 16 bits major, lower 16 bits minor
            msg->param[9] = ((1) << 16 | (5));
            break;

        /* Unknown message. */
        default:
            msg->head.type = SRTM_MessageTypeNotification;
            msg->error     = SRTM_Status_InvalidMessage;
            break;
    }

    return 0;
}

static int handleMSG_AUDIO(dsp_handle_t *dsp, srtm_message *msg)
{
    char *remote_addr;

    dsp->event_occur = false;

