Masmiseim36/nxpSDK/boards/mimxrt685audevk/dsp_examples/xaf_playback/dsp/xaf_main_dsp.c
    switch (msg->head.command)
    {
        case SRTM_Command_MP3:
            /* Param 0 MP3 input buffer address*/
            /* Param 1 MP3 input buffer size*/
            /* Param 2 PCM output buffer address*/
            /* Param 3 PCM output buffer size*/
            /* Param 4 decode output location */
            /* Param 5 return parameter, actual read size */
            /* Param 6 return parameter, actual write size */
            DSP_PRINTF(
                "[DSP_Main] MP3 input buffer addr 0x%X, buffer size %d, output buffer addr 0x%X, output buffer size "
                "%d\r\n",
                msg->param[0], msg->param[1], msg->param[2], msg->param[3]);
            if ((msg->param[0] == 0) || (msg->param[1] == 0) || (msg->param[2] == 0) || (msg->param[3] == 0))
            {
                msg->head.type = SRTM_MessageTypeNotification;
                msg->error     = SRTM_Status_InvalidParameter;
                break;
            }
            msg->error = srtm_decoder(dsp, &msg->param[0], SRTM_Command_MP3);
            break;

        case SRTM_Command_OPUS_DEC:
            /* Param 0 OPUS input buffer address*/
            /* Param 1 OPUS input buffer size*/
            /* Param 2 PCM output buffer address*/
            /* Param 3 PCM output buffer size*/
            /* Param 4 decode output location */
            /* Param 5 return parameter, actual read size */
            /* Param 6 return parameter, actual write size */
            DSP_PRINTF(
                "[DSP_Main] OPUS input buffer addr 0x%X, buffer size %d, output buffer addr 0x%X, output buffer size "
                "%d\r\n",
                msg->param[0], msg->param[1], msg->param[2], msg->param[3]);
            if ((msg->param[0] == 0) || (msg->param[1] == 0) || (msg->param[2] == 0) || (msg->param[3] == 0))
            {
                msg->head.type = SRTM_MessageTypeNotification;
                msg->error     = SRTM_Status_InvalidParameter;
                break;
            }
            msg->error = srtm_decoder(dsp, &msg->param[0], SRTM_Command_OPUS_DEC);
            break;

        case SRTM_Command_OPUS_ENC:
            /* Param 0 PCM input buffer address*/
            /* Param 1 PCM input buffer size*/
            /* Param 2 OPUS output buffer address*/
            /* Param 3 OPUS output buffer size*/
            /* Param 4 return parameter, actual read size */
            /* Param 5 return parameter, actual write size */
            DSP_PRINTF(
                "[DSP_Main] PCM input buffer addr 0x%X, buffer size %d, OPUS output buffer addr 0x%X, output buffer "
                "size %\r\n",
                msg->param[0], msg->param[1], msg->param[2], msg->param[3]);
            if ((msg->param[0] == 0) || (msg->param[1] == 0) || (msg->param[2] == 0) || (msg->param[3] == 0))
            {
                msg->head.type = SRTM_MessageTypeNotification;
                msg->error     = SRTM_Status_InvalidParameter;
                break;
            }
            msg->error = srtm_encoder(dsp, &msg->param[0], SRTM_Command_OPUS_ENC);
            break;

        case SRTM_Command_SBC_DEC:
            /* Param 0 SBC input buffer address*/
            /* Param 1 SBC input buffer size*/
            /* Param 2 PCM output buffer address*/
            /* Param 3 PCM output buffer size*/
            /* Param 4 decode output location */
            /* Param 5 return parameter, actual read size */
            /* Param 6 return parameter, actual write size */
            DSP_PRINTF(
                "[DSP_Main] SBC input buffer addr 0x%X, buffer size %d, output buffer addr 0x%X, output buffer size "
                "%d\r\n",
                msg->param[0], msg->param[1], msg->param[2], msg->param[3]);
            if ((msg->param[0] == 0) || (msg->param[1] == 0) || (msg->param[2] == 0) || (msg->param[3] == 0))
            {
                msg->head.type = SRTM_MessageTypeNotification;
                msg->error     = SRTM_Status_InvalidParameter;
                break;
            }
            msg->error = srtm_decoder(dsp, &msg->param[0], SRTM_Command_SBC_DEC);
            break;

        case SRTM_Command_SBC_ENC:
            /* Param 0 PCM input buffer address*/
            /* Param 1 PCM input buffer size*/
            /* Param 2 SBC output buffer address*/
            /* Param 3 SBC output buffer size*/
            /* Param 4 return parameter, actual read size */
            /* Param 5 return parameter, actual write size */
            DSP_PRINTF(
                "[DSP_Main] PCM input buffer addr 0x%X, buffer size %d, SBC output buffer addr 0x%X, output buffer "
                "size %d\r\n",
                msg->param[0], msg->param[1], msg->param[2], msg->param[3]);
            if ((msg->param[0] == 0) || (msg->param[1] == 0) || (msg->param[2] == 0) || (msg->param[3] == 0))
            {
                msg->head.type = SRTM_MessageTypeNotification;
                msg->error     = SRTM_Status_InvalidParameter;
                break;
            }
            msg->error = srtm_encoder(dsp, &msg->param[0], SRTM_Command_SBC_ENC);
            break;

        case SRTM_Command_AAC:
            /* Param 0 AAC input buffer address*/
            /* Param 1 AAC input buffer size*/
            /* Param 2 PCM output buffer address*/
            /* Param 3 PCM output buffer size*/
            /* Param 4 decode output location */
            /* Param 5 return parameter, actual read size */
            /* Param 6 return parameter, actual write size */
            DSP_PRINTF(
                "[DSP_Main] AAC input buffer addr 0x%X, buffer size %d, output buffer addr 0x%X, output buffer size "
                "%d\r\n",
                msg->param[0], msg->param[1], msg->param[2], msg->param[3]);
            if ((msg->param[0] == 0) || (msg->param[1] == 0) || (msg->param[2] == 0) || (msg->param[3] == 0))
            {
                msg->head.type = SRTM_MessageTypeNotification;
                msg->error     = SRTM_Status_InvalidParameter;
                break;
            }
            msg->error = srtm_decoder(dsp, &msg->param[0], SRTM_Command_AAC);
            break;

        case SRTM_Command_VORBIS:
            /* Param 0 VORBIS input buffer address */
            /* Param 1 VORBIS input buffer size */
            /* Param 2 PCM output buffer address */
            /* Param 3 PCM output buffer size */
            /* Param 4 decode output location */
            /* Param 5 return parameter, actual read size */
            /* Param 6 return parameter, actual write size */
            /* Param 7 VORBIS input buffer is raw (1) or OGG encapsulated (0) */
            DSP_PRINTF(
                "[DSP_Main] VORBIS input buffer addr 0x%X, buffer size %d, "
                "output buffer addr 0x%X, output buffer size %d, "
                "output_renderer %d, raw_input %d\r\n",
                msg->param[0], msg->param[1], msg->param[2], msg->param[3], msg->param[4], msg->param[7]);
            if ((msg->param[0] == 0) || (msg->param[1] == 0) || (msg->param[2] == 0) || (msg->param[3] == 0))
            {
                msg->head.type = SRTM_MessageTypeNotification;
                msg->error     = SRTM_Status_InvalidParameter;
                break;
            }
            msg->error = srtm_decoder(dsp, &msg->param[0], SRTM_Command_VORBIS);
            break;

        case SRTM_Command_SRC:
            /* Param 0 SRC input buffer 1 address*/
            /* Param 1 SRC input buffer 1 size*/
            /* Param 2 SRC input sampling rate*/
            /* Param 3 SRC input channels*/
            /* Param 4 SRC input sample width*/
            /* Param 5 SRC output buffer address*/
            /* Param 6 SRC output buffer size*/
            /* Param 7 SRC output sampling rate*/
            /* Param 8 return paramter, actual read size of input*/
            /* Param 9 return paramter, actual write size of output*/
            DSP_PRINTF(
                "[DSP_Main] Input buffer addr 0x%X, size %d, rate %d, channels %d, sample width %d, output buffer "
                "addr 0x%X, size %d, rate %d\r\n",
                msg->param[0], msg->param[1], msg->param[2], msg->param[3], msg->param[4], msg->param[5], msg->param[6],
                msg->param[7]);
            if ((msg->param[0] == 0) || (msg->param[1] == 0) || (msg->param[2] == 0) || (msg->param[3] == 0) ||
                (msg->param[4] == 0) || (msg->param[5] == 0) || (msg->param[6] == 0) || (msg->param[7] == 0))
            {
                msg->head.type = SRTM_MessageTypeNotification;
                msg->error     = SRTM_Status_ServiceNotFound;
                break;
            }
            msg->error = srtm_src(dsp, &msg->param[0]);
            break;

        case SRTM_Command_GAIN:
            /* Param 0 PCM input buffer address*/
            /* Param 1 PCM input buffer size*/
            /* Param 2 PCM output buffer address*/
            /* Param 3 PCM output buffer size*/
            /* Param 4 PCM sampling rate, default 44100*/
            /* Param 5 PCM number of channels, only 1 or 2 supported, default 1*/
            /* Param 6 PCM sample width, default 16*/
            /* Param 7 Gain control index, default is 4, range is 0 to 6 -> {0db, -6db, -12db, -18db, 6db,
            12db,
             * 18db}*/
            /* Param 8 return parameter, actual read bytes*/
            /* Param 9 return parameter, actual written bytes*/
            msg->param[10] = msg->param[0];
            msg->param[11] = msg->param[1];
            msg->param[12] = msg->param[2];
            msg->param[13] = msg->param[3];
            msg->param[14] = msg->param[4];
            msg->param[15] = msg->param[5];
            msg->param[16] = msg->param[6];
            msg->param[17] = msg->param[7];
            DSP_PRINTF(
                "[DSP_Main] Input buffer addr 0x%X, size %d, output buffer addr 0x%X, size %d, sampling rate %d, num "
                "of channels %d, pcm sample width %d, gain control index %d\r\n",
                msg->param[0], msg->param[1], msg->param[2], msg->param[3], msg->param[4], msg->param[5], msg->param[6],
                msg->param[7]);
            if ((msg->param[0] == 0) || (msg->param[1] == 0) || (msg->param[2] == 0) || (msg->param[3] == 0) ||
                (msg->param[4] == 0) || (msg->param[5] == 0) || (msg->param[6] == 0))
            {
                msg->head.type = SRTM_MessageTypeNotification;
                msg->error     = SRTM_Status_InvalidParameter;
            }
            else
            {
                msg->error = srtm_pcm_gain(dsp, &msg->param[0]);
            }
            break;

        case SRTM_Command_FileStart:
            /* Param 0 File buffer */
            /* Param 1 File buffer size */
            /* Param 2 EOF (true/false) */
            /* Param 3 Audio codec component type */
            /* Param 4 Number of channels */
            /* Param 5 Sample rate */
            /* Param 6 Pcm width */
            if ((msg->param[0] == 0) || (msg->param[1] == 0)
#ifdef MULTICHANNEL
                || ((msg->param[3] == DSP_COMPONENT_NONE) &&
                ((msg->param[4] == 0) || (msg->param[5] == 0) || (msg->param[6] == 0)))
#endif
            )
            {
                msg->head.type = SRTM_MessageTypeNotification;
                msg->error     = SRTM_Status_InvalidParameter;
            }
#ifdef MULTICHANNEL
#ifdef EAP32_PROC
            if (msg->param[3] != DSP_COMPONENT_NONE)
            {
                DSP_PRINTF("Cannot play other than 96kHz PCM file with EAP32 enabled. Please disable EAP first.\r\n");
                msg->head.type = SRTM_MessageTypeNotification;
                msg->error     = SRTM_Status_InvalidParameter;
            }
#elif (defined(EAP_PROC))
            if (msg->param[3] == DSP_COMPONENT_NONE && msg->param[4] == 2 && msg->param[5] == 96000)
            {
                DSP_PRINTF("Cannot play 96kHz PCM file with EAP(16) enabled. Please enable EAP32_PROC first.\r\n");
                msg->head.type = SRTM_MessageTypeNotification;
                msg->error     = SRTM_Status_InvalidParameter;
            }
#endif
#endif
            /* Check to see if file already playing */
            else if (dsp->file_playing)
            {
                msg->error = SRTM_Status_InvalidState;
            }
            else
            {
                DSP_PRINTF("[DSP_Main] File playback start, initial buffer size: %d\r\n", msg->param[1]);
                /* Clear ringbuffer from previous playback */
                ringbuf_clear(dsp->audioBuffer);

#if (defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET)
                remote_addr = (char *)MEMORY_ConvertMemoryMapAddress(msg->param[0], kMEMORY_Local2DMA);
#else
                remote_addr = (char *)msg->param[0];
#endif

                /* Write initial data chunk to the ringbuffer */
                DSP_AudioWriteRing(dsp, remote_addr, msg->param[1]);
                /* Initialize pipeline */
                dsp->eof         = msg->param[2];
                dsp->ipc_waiting = false;
#ifdef MULTICHANNEL
                if (msg->param[3] == DSP_COMPONENT_NONE)
                {
                    msg->error = srtm_file_ren_create(dsp, &msg->param[3]);
                }
                else
#endif
                {
                    msg->error    = srtm_file_dec_create(dsp, msg->param[3]);
                    msg->param[0] = dsp->channel_num;
                }
            }
            break;

        case SRTM_Command_FileData:
            /* Param 0 File buffer */
            /* Param 1 File buffer size */
            /* Param 2 File EOF status (boolean true/false) */
            if (msg->param[0] == 0)
            {
                msg->head.type = SRTM_MessageTypeNotification;
                msg->error     = SRTM_Status_InvalidParameter;
            }
            else
            {
#if (defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET)
                remote_addr = (char *)MEMORY_ConvertMemoryMapAddress(msg->param[0], kMEMORY_Local2DMA);
#else
                remote_addr = (char *)msg->param[0];
#endif

                DSP_AudioWriteRing(dsp, remote_addr, msg->param[1]);
                /* Signal EOF to processing thread if set by remote */
                if (msg->param[2])
                {
                    dsp->eof = true;
                }
            }

            dsp->ipc_waiting = false;

            /* Send signal to wake DSP_BufferThread */
            xos_cond_signal(&dsp->ipc_waiting_cond, 0);
            break;

